/*
  1. Да реализираме числов интервал - клас Interval, който да бъде
  шаблонен по типа на краищата си. Той трябва да съдържа следните данни:
  - две числа lower, upper - краища на отворения интервал (lower, upper);
  Казваме, че един интервал е валиден, когато lower <= upper.
  - статична член-данна INVALID_INTERVAL от тип Interval, която ще
  ползваме за отбелязване на невалидни интервали.

  Да реализираме следните операции към него:
  - конструктор по подразбиране, който инициализира upper и lower с 0;
  - член-функция (метод) init, която приема две числа A и B и връща обект от тип
  Interval, който представлява интервал с краища числата A и B.
  - метод isValid, който проверява дали даден интервал е валиден.
   
  - метод union, който приема два интервала и връща тяхното обединение.
  *забележка:* това обединение винаги съществува. 
  - метод intersect, който приема два интервала и връща сечението между тях.
  Ако сечението е празен интервал, трябва да връща невалидния интервал.
*/